{"entity": {"accumulator": 1, "active-provider-chest": 2, "arithmetic-combinator": 3, "artillery-turret": 4, "assembling-machine-1": 5, "assembling-machine-2": 6, "assembling-machine-3": 7, "beacon": 8, "big-electric-pole": 9, "boiler": 10, "buffer-chest": 11, "bulk-inserter": 12, "burner-generator": 13, "burner-inserter": 14, "burner-mining-drill": 15, "centrifuge": 16, "chemical-plant": 17, "constant-combinator": 18, "decider-combinator": 19, "electric-energy-interface": 20, "electric-furnace": 21, "electric-mining-drill": 22, "express-loader": 23, "express-splitter": 24, "express-transport-belt": 25, "express-underground-belt": 26, "fast-inserter": 27, "fast-loader": 28, "fast-splitter": 29, "fast-transport-belt": 30, "fast-underground-belt": 31, "flamethrower-turret": 32, "gate": 33, "gun-turret": 34, "heat-exchanger": 35, "heat-interface": 36, "heat-pipe": 37, "infinity-chest": 38, "infinity-pipe": 39, "inserter": 40, "iron-chest": 41, "lab": 42, "land-mine": 43, "laser-turret": 44, "linked-belt": 45, "linked-chest": 46, "loader": 47, "long-handed-inserter": 48, "medium-electric-pole": 49, "nuclear-reactor": 50, "offshore-pump": 51, "oil-refinery": 52, "overflow-valve": 53, "passive-provider-chest": 54, "pipe": 55, "pipe-to-ground": 56, "power-switch": 57, "programmable-speaker": 58, "pump": 59, "pumpjack": 60, "radar": 61, "rail-chain-signal": 62, "rail-signal": 63, "requester-chest": 64, "roboport": 65, "rocket-silo": 66, "selector-combinator": 67, "small-electric-pole": 68, "small-lamp": 69, "solar-panel": 70, "splitter": 71, "steam-engine": 72, "steam-turbine": 73, "steel-chest": 74, "steel-furnace": 75, "stone-furnace": 76, "stone-wall": 77, "storage-chest": 78, "storage-tank": 79, "substation": 80, "train-stop": 81, "transport-belt": 82, "underground-belt": 83, "valve": 84, "wooden-chest": 85, "factorio-rail": 86}, "recipe": {"advanced-circuit": 1, "copper-cable": 2, "electronic-circuit": 3, "low-density-structure": 4, "engine-unit": 5, "iron-gear-wheel": 6, "rocket-fuel": 7, "processing-unit": 8, "plastic-bar": 9, "rocket-control-unit": 10, "chemical-science-pack": 11, "solid-fuel-from-light-oil": 12, "utility-science-pack": 13, "logistic-science-pack": 14, "automation-science-pack": 15, "light-oil-cracking": 16, "flying-robot-frame": 17, "advanced-oil-processing": 18, "speed-module": 19, "battery": 20, "productivity-module": 21, "military-science-pack": 22, "production-science-pack": 23, "electric-engine-unit": 24, "uranium-processing": 25, "grenade": 26, "pipe": 27, "sulfur": 28, "heavy-oil-cracking": 29, "kovarex-enrichment-process": 30, "rail": 31, "solid-fuel-from-petroleum-gas": 32, "iron-stick": 33, "piercing-rounds-magazine": 34, "basic-oil-processing": 35, "transport-belt": 36, "solar-panel": 37, "inserter": 38, "electric-furnace": 39, "sulfuric-acid": 40, "coal-liquefaction": 41, "explosives": 42, "firearm-magazine": 43, "lubricant": 44, "concrete": 45, "explosive-cannon-shell": 46, "accumulator": 47, "gun-turret": 48, "electric-mining-drill": 49, "uranium-rounds-magazine": 50, "stone-wall": 51, "parameter-0": 52, "rocket-part": 53, "speed-module-2": 54, "productivity-module-2": 55, "underground-belt": 56, "fast-inserter": 57, "effectivity-module": 58, "splitter": 59, "assembling-machine-1": 60, "science-pack-2": 61, "nuclear-fuel": 62, "long-handed-inserter": 63, "artillery-shell": 64, "radar": 65, "assembling-machine-2": 66, "fast-transport-belt": 67, "copper-plate": 68, "iron-plate": 69, "refined-concrete": 70, "fast-underground-belt": 71, "pipe-to-ground": 72, "fast-splitter": 73, "storage-tank": 74, "laser-turret": 75, "high-tech-science-pack": 76, "medium-electric-pole": 77, "construction-robot": 78, "steel-chest": 79, "cargo-wagon": 80, "productivity-module-3": 81, "efficiency-module": 82, "big-electric-pole": 83, "express-transport-belt": 84, "stack-inserter": 85, "speed-module-3": 86, "science-pack-1": 87, "steel-furnace": 88, "locomotive": 89, "fluid-wagon": 90, "roboport": 91, "express-underground-belt": 92, "chemical-plant": 93, "rail-signal": 94, "small-lamp": 95, "train-stop": 96, "rail-chain-signal": 97, "science-pack-3": 98, "assembling-machine-3": 99, "substation": 100, "satellite": 101, "express-splitter": 102, "oil-refinery": 103, "pumpjack": 104, "pump": 105, "repair-pack": 106, "landfill": 107, "y_chip_plate_recipe": 108, "logistic-robot": 109, "nuclear-fuel-reprocessing": 110, "beacon": 111, "effectivity-module-2": 112, "rocket": 113, "filter-inserter": 114, "explosive-uranium-cannon-shell": 115, "stone-furnace": 116, "steam-engine": 117, "uranium-fuel-cell": 118, "decider-combinator": 119, "shotgun-shell": 120, "uranium-cannon-shell": 121, "arithmetic-combinator": 122, "stack-filter-inserter": 123, "lab": 124, "constant-combinator": 125, "steam-turbine": 126, "steel-plate": 127, "logistic-chest-storage": 128, "heat-pipe": 129, "heat-exchanger": 130, "logistic-chest-passive-provider": 131, "electronic-circuit-stone": 132, "offshore-pump": 133, "nuclear-reactor": 134, "explosive-rocket": 135, "cliff-explosives": 136, "solid-fuel-from-heavy-oil": 137, "boiler": 138, "gate": 139, "logistic-chest-requester": 140, "logistic-chest-active-provider": 141, "centrifuge": 142, "efficiency-module-2": 143, "defender-capsule": 144, "flamethrower-turret": 145, "burner-inserter": 146, "empty-barrel": 147, "small-electric-pole": 148, "red-wire": 149, "green-wire": 150, "empty-water-barrel": 151, "motor": 152, "iron-chest": 153, "empty-heavy-oil-barrel": 154, "logistic-chest-buffer": 155, "electric-motor": 156, "flamethrower-ammo": 157, "effectivity-module-3": 158, "power-switch": 159, "personal-roboport-equipment": 160, "battery-equipment": 161, "energy-shield-equipment": 162, "carbon": 163, "empty-lubricant-barrel": 164, "programmable-speaker": 165, "battery-mk2-equipment": 166, "energy-shield-mk2-equipment": 167, "exoskeleton-equipment": 168, "steel-gear-wheel": 169, "bulk-inserter": 170, "empty-crude-oil-barrel": 171, "hazard-concrete": 172, "personal-roboport-mk2-equipment": 173, "personal-laser-defense-equipment": 174, "distractor-capsule": 175, "wood": 176, "refined-hazard-concrete": 177, "ammonia": 178, "petroleum-gas-sweetening": 179, "efficiency-module-3": 180, "fill-heavy-oil-barrel": 181, "artillery-turret": 182, "cannon-shell": 183, "fusion-reactor-equipment": 184, "poison-capsule": 185, "tank": 186, "land-mine": 187, "passive-provider-chest": 188, "storage-chest": 189, "iron-beam": 190, "sand-from-stone": 191, "slowdown-capsule": 192, "simple-coal-liquefaction": 193, "empty-light-oil-barrel": 194, "atomic-bomb": 195, "automation-core": 196, "piercing-shotgun-shell": 197, "car": 198, "fill-light-oil-barrel": 199, "solar-panel-equipment": 200, "cluster-grenade": 201, "night-vision-equipment": 202, "empty-petroleum-gas-barrel": 203, "destroyer-capsule": 204, "requester-chest": 205, "17-chemical-science-pack": 206, "fill-petroleum-gas-barrel": 207, "stone-tablet": 208, "artillery-wagon": 209, "rocket-launcher": 210, "bob-resin-wood": 211, "active-provider-chest": 212, "fill-sulfuric-acid-barrel": 213, "empty-sulfuric-acid-barrel": 214, "steel-rod": 215, "rocket-silo": 216, "flying-robot-frame-3": 217, "burner-mining-drill": 218, "wooden-chest": 219, "power-armor-mk2": 220, "spidertron": 221, "steel-beam": 222, "space-platform-foundation": 223, "buffer-chest": 224, "belt-immunity-equipment": 225, "electronic-components": 226, "kr-steel-pipe": 227, "steam-condensation": 228, "discharge-defense-equipment": 229, "submachine-gun": 230, "robot-brain-logistic-3": 231, "napalm-artillery-shell": 232, "ground-sample01": 233, "power-armor": 234, "flamethrower": 235, "petroleum-gas-barrel": 236, "burner-assembling-machine": 237, "small-iron-electric-pole": 238, "iron-gear-wheel-s": 239, "fill-lubricant-barrel": 240, "17-low-density-structure": 241, "barrel": 242, "superior-circuit-board": 243, "modular-armor": 244, "shotgun": 245, "se-space-transport-belt": 246, "blank-tech-card": 247, "inserter-parts": 248, "se-cargo-rocket-cargo-pod": 249, "se-cargo-rocket-fuel-tank": 250, "artillery-targeting-remote": 251, "discharge-defense-remote": 252, "selector-combinator": 253, "light-armor": 254, "pistol": 255, "combat-shotgun": 256, "acid-neutralisation": 257, "tungsten-carbide": 258, "fill-crude-oil-barrel": 259, "heavy-armor": 260, "robot-brain-logistic-4": 261, "robot-brain-logistic-2": 262, "steel-axe": 263, "fill-water-barrel": 264, "heavy-oil-barrel": 265, "light-oil-barrel": 266, "se-pulveriser": 267, "spidertron-remote": 268, "display-panel": 269, "kr-fuel-refinery": 270, "ei_steam-engine": 271, "fibreglass-board": 272, "robot-brain-construction-3": 273, "fission-reactor-equipment": 274, "robot-brain-logistic": 275, "kr-filtration-plant": 276, "kr-electrolysis-plant": 277, "rocket-turret": 278, "industrial-furnace": 279, "oil-processing-heavy": 280, "17-military-science-pack": 281, "17-production-science-pack": 282, "17-utility-science-pack": 283, "kr-steel-pump": 284, "kr-fluid-storage-1": 285, "kr-fluid-storage-2": 286, "kr-steel-pipe-to-ground": 287, "ice-melting": 288, "kr-loader": 289, "kr-mineral-water-pumpjack": 290, "kr-electric-mining-drill-mk2": 291, "solid-fuel-from-ammonia": 292, "decompress-iron": 293, "area-mining-drill": 294, "fuel-processor": 295, "se-heat-shielding": 296, "bob-basic-transport-belt": 297, "ei_copper-mechanical-parts": 298, "ei_iron-mechanical-parts": 299, "titanium-gear-wheel": 300, "titanium-bearing-ball": 301, "titanium-bearing": 302, "thruster": 303, "iron-axe": 304, "rail-support": 305, "rail-ramp": 306, "kr-superior-splitter": 307, "kr-superior-transport-belt": 308, "kr-superior-underground-belt": 309, "kr-advanced-splitter": 310, "kr-advanced-transport-belt": 311, "kr-advanced-underground-belt": 312, "kr-fast-loader": 313, "basic-tech-card": 314, "water-barrel": 315, "artificial-yumako-soil": 316, "artificial-jellynut-soil": 317, "lithium": 318, "kr-advanced-radar": 319, "kr-atmospheric-condenser": 320, "kr-crusher": 321, "kr-fluid-burner": 322, "parameter-1": 323, "agricultural-tower": 324, "ammoniacal-solution-separation": 325, "waterfill": 326, "tin-gear-wheel": 327, "tin-plate": 328, "ice-platform": 329, "sct-t1-magnet-coils": 330, "wooden-board-paper": 331, "sct-t1-ironcore": 332, "paper-bleaching-1": 333, "quality-module": 334, "aai-strongbox-storage": 335, "aai-strongbox-buffer": 336, "aai-strongbox-requester": 337, "aai-strongbox": 338, "aai-strongbox-passive-provider": 339, "aai-strongbox-active-provider": 340, "fast-loader": 341, "loader": 342, "rifle-magazine": 343, "armor-piercing-rifle-magazine": 344, "robot-tool-logistic-3": 345, "bob-logistic-robot-3": 346, "bob-construction-robot-3": 347, "robot-tool-construction-3": 348, "cargo-bay": 349, "asteroid-collector": 350, "crusher": 351, "space-platform-starter-pack": 352, "se-space-underground-belt": 353, "se-space-splitter": 354, "ammo-nano-constructors": 355, "green-module-8": 356, "green-module-7": 357, "green-module-6": 358, "green-module-5": 359, "green-module-4": 360, "green-module-3": 361, "green-module-2": 362, "green-module-1": 363, "kr-advanced-steam-turbine": 364, "kr-substation-mk2": 365, "kr-advanced-furnace": 366, "kr-advanced-chemical-plant": 367, "kr-advanced-assembling-machine": 368, "overgrowth-yumako-soil": 369, "overgrowth-jellynut-soil": 370, "energy-shield-mk3-equipment": 371, "battery-mk3-equipment": 372, "night-vision-mk2-equipment": 373, "copper-cartridge": 374, "iron-magazine": 375, "kr-superior-loader": 376, "kr-advanced-loader": 377, "kr-express-loader": 378, "imersium-gear-wheel": 379, "holmium-solution": 380, "express-miniloader": 381, "fast-miniloader": 382, "miniloader": 383, "electromagnetic-plant": 384, "lightning-rod": 385, "recycler": 386, "aai-warehouse-storage": 387, "aai-warehouse-buffer": 388, "aai-warehouse-requester": 389, "aai-warehouse": 390, "aai-warehouse-passive-provider": 391, "aai-warehouse-active-provider": 392, "heating-tower": 393, "sulfuric-acid-barrel": 394, "lubricant-barrel": 395, "se-fuel-refinery": 396, "se-electric-boiler": 397, "logistic-train-stop": 398, "biochamber": 399, "yumako-processing": 400, "textplate-small-copper": 401, "textplate-small-gold": 402, "textplate-small-iron": 403, "textplate-small-plastic": 404, "textplate-small-stone": 405, "textplate-small-uranium": 406, "textplate-large-copper": 407, "textplate-large-gold": 408, "textplate-large-iron": 409, "textplate-large-plastic": 410, "textplate-large-stone": 411, "textplate-large-uranium": 412, "mining-drone": 413, "mining-depot": 414, "lane-balancer": 415, "fast-lane-balancer": 416}, "item": {"speed-module-3": 1, "productivity-module-3": 2, "productivity-module": 3, "iron-ore": 4, "speed-module": 5, "iron-plate": 6, "effectivity-module": 7, "copper-ore": 8, "speed-module-2": 9, "copper-plate": 10, "steel-plate": 11, "efficiency-module-3": 12, "productivity-module-2": 13, "uranium-235": 14, "electronic-circuit": 15, "uranium-238": 16, "coal": 17, "advanced-circuit": 18, "stone": 19, "null": 20, "plastic-bar": 21, "effectivity-module-3": 22, "stone-brick": 23, "piercing-rounds-magazine": 24, "solid-fuel": 25, "efficiency-module": 26, "deconstruction-planner": 27, "automation-science-pack": 28, "uranium-rounds-magazine": 29, "low-density-structure": 30, "production-science-pack": 31, "chemical-science-pack": 32, "rocket-fuel": 33, "express-transport-belt": 34, "space-science-pack": 35, "processing-unit": 36, "military-science-pack": 37, "utility-science-pack": 38, "rail": 39, "logistic-science-pack": 40, "construction-robot": 41, "rocket-control-unit": 42, "fast-inserter": 43, "logistic-robot": 44, "copper-cable": 45, "uranium-fuel-cell": 46, "pipe": 47, "parameter-0": 48, "iron-gear-wheel": 49, "inserter": 50, "express-underground-belt": 51, "cluster-grenade": 52, "empty-barrel": 53, "engine-unit": 54, "firearm-magazine": 55, "rail-signal": 56, "raw-speed-module-1": 57, "express-splitter": 58, "big-electric-pole": 59, "train-stop": 60, "iron-chest": 61, "efficiency-module-2": 62, "nuclear-fuel": 63, "flying-robot-frame": 64, "raw-fish": 65, "sulfur": 66, "atomic-bomb": 67, "poison-capsule": 68, "shotgun-shell": 69, "long-handed-inserter": 70, "battery": 71, "pipe-to-ground": 72, "pump": 73, "quality-module-3": 74, "effectivity-module-2": 75, "artillery-shell": 76, "stone-wall": 77, "concrete": 78, "landfill": 79, "uranium-ore": 80, "quality-module-2": 81, "roboport": 82, "accumulator": 83, "passive-provider-chest": 84, "raw-productivity-module-1": 85, "transport-belt": 86, "solar-panel": 87, "active-provider-chest": 88, "grenade": 89, "electric-engine-unit": 90, "storage-tank": 91, "small-lamp": 92, "stack-inserter": 93, "electric-furnace": 94, "fast-transport-belt": 95, "fast-underground-belt": 96, "repair-pack": 97, "filter-inserter": 98, "logistic-chest-passive-provider": 99, "explosives": 100, "beacon": 101, "quality-module": 102, "iron-stick": 103, "medium-electric-pole": 104, "logistic-chest-active-provider": 105, "wood": 106, "rail-chain-signal": 107, "underground-belt": 108, "laser-turret": 109, "substation": 110, "bulk-inserter": 111, "crude-oil-barrel": 112, "cliff-explosives": 113, "used-up-uranium-fuel-cell": 114, "iron-axe": 115, "fast-splitter": 116, "radar": 117, "steel-chest": 118, "logistic-chest-requester": 119, "gun-turret": 120, "rocket-silo": 121, "gate": 122, "heavy-oil-barrel": 123, "splitter": 124, "flamethrower-turret": 125, "decider-combinator": 126, "arithmetic-combinator": 127, "spoilage": 128, "stack-filter-inserter": 129, "parameter-1": 130, "parameter-2": 131, "parameter-3": 132, "constant-combinator": 133, "water-barrel": 134, "electric-mining-drill": 135, "programmable-speaker": 136, "depleted-uranium-fuel-cell": 137, "oil-refinery": 138, "assembling-machine-3": 139, "pumpjack": 140, "logistic-chest-storage": 141, "chemical-plant": 142, "petroleum-gas-barrel": 143, "refined-concrete": 144, "high-tech-science-pack": 145, "power-switch": 146, "red-wire": 147, "wooden-chest": 148, "science-pack-2": 149, "offshore-pump": 150, "green-wire": 151, "science-pack-3": 152, "requester-chest": 153, "cargo-wagon": 154, "small-electric-pole": 155, "lab": 156, "land-mine": 157, "locomotive": 158, "science-pack-1": 159, "sulfuric-acid-barrel": 160, "heat-pipe": 161, "lubricant-barrel": 162, "logistic-chest-buffer": 163, "heat-exchanger": 164, "steel-furnace": 165, "fluid-wagon": 166, "assembling-machine-2": 167, "nuclear-reactor": 168, "explosive-cannon-shell": 169, "space-platform-foundation": 170, "glass": 171, "parameter-4": 172, "parameter-5": 173, "satellite": 174, "blueprint-book": 175, "steam-turbine": 176, "holmium-plate": 177, "artillery-turret": 178, "rocket": 179, "slowdown-capsule": 180, "distractor-capsule": 181, "hazard-concrete": 182, "explosive-rocket": 183, "buffer-chest": 184, "light-oil-barrel": 185, "air-filter": 186, "storage-chest": 187, "tungsten-ore": 188, "steam-engine": 189, "burner-inserter": 190, "car": 191, "ei_steam-engine": 192, "assembling-machine-1": 193, "destroyer-capsule": 194, "belt-immunity-equipment": 195, "centrifuge": 196, "blueprint": 197, "upgrade-planner": 198, "artificial-yumako-soil": 199, "artificial-jellynut-soil": 200, "electric-motor": 201, "steel-gear-wheel": 202, "lithium-plate": 203, "calcite": 204, "carbon-fiber": 205, "uranium-cannon-shell": 206, "cannon-shell": 207, "waterfill": 208, "cargo-bay": 209, "asteroid-collector": 210, "crusher": 211, "thruster": 212, "pistol": 213, "personal-roboport-mk2-equipment": 214, "fusion-reactor-equipment": 215, "steel-axe": 216, "power-armor-mk2": 217, "battery-mk2-equipment": 218, "exoskeleton-equipment": 219, "raw-wood": 220, "motor": 221, "tank": 222, "refined-hazard-concrete": 223, "stone-furnace": 224, "burner-mining-drill": 225, "boiler": 226, "rocket-launcher": 227, "steel-beam": 228, "rare-metals": 229, "superconductor": 230, "quantum-processor": 231, "biter-egg": 232, "defender-capsule": 233, "discharge-defense-remote": 234, "artillery-targeting-remote": 235, "yumako-seed": 236, "yumako-mash": 237, "iron-beam": 238, "automation-core": 239, "inserter-parts": 240}, "floor": {"landfill": 1, "refined-concrete": 2, "stone-path": 3, "concrete": 4, "refined-hazard-concrete-left": 5, "hazard-concrete-left": 6, "hazard-concrete-right": 7, "refined-hazard-concrete-right": 8, "Arci-asphalt": 9, "se-space-platform-scaffold": 10, "kr-black-reinforced-plate": 11, "water": 12, "grass-4": 13, "ice-platform": 14, "dect-coal-gravel": 15, "se-spaceship-floor": 16, "space-platform-foundation": 17, "water-shallow": 18, "dect-paint-refined-emergency-left": 19, "se-space-platform-plating": 20, "dect-concrete-grid": 21, "sand-3": 22, "dect-paint-danger-right": 23, "dect-paint-danger-left": 24, "deepwater": 25, "dect-paint-refined-emergency-right": 26, "dect-paint-radiation-right": 27, "dect-paint-radiation-left": 28, "cyan-refined-concrete": 29, "dect-paint-defect-left": 30, "dect-paint-defect-right": 31, "blue-refined-concrete": 32, "stone-gravel": 33, "dect-iron-ore-gravel": 34, "dect-copper-ore-gravel": 35, "black-refined-concrete": 36, "dect-stone-gravel": 37}}